potobuf_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="4.0" jmeter="4.0 r1823414">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="线程组" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">100</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="house_tracking_1" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
	&quot;logs&quot;: [{&#xd;
		&quot;log_ver&quot;: 1,&#xd;
		&quot;timestamp&quot;: 1591091024754,&#xd;
		&quot;level&quot;: &quot;I&quot;,&#xd;
		&quot;message&quot;: &quot;${message_1}&quot;,&#xd;
		&quot;req_id&quot;: &quot;7093212f&quot;,&#xd;
		&quot;uid&quot;: &quot;dcd664f3cb1834c3c01a7d30adf5c6efe8&quot;,&#xd;
		&quot;code_ver&quot;: &quot;6185&quot;,&#xd;
		&quot;tag&quot;: &quot;in_house_tracking&quot;,&#xd;
		&quot;sys_info&quot;: &quot;samsung,SM-G9600,9&quot;,&#xd;
		&quot;app_ver&quot;: &quot;5.35.0&quot;,&#xd;
		&quot;api_ver&quot;: &quot;7.0&quot;,&#xd;
		&quot;sdk_ver&quot;: &quot;28&quot;,&#xd;
	    &quot;type&quot;: 3&#xd;
	},&#xd;
	{&#xd;
		&quot;log_ver&quot;: 1,&#xd;
		&quot;timestamp&quot;: 1591091024754,&#xd;
		&quot;level&quot;: &quot;I&quot;,&#xd;
		&quot;message&quot;: &quot;${message_2}&quot;,&#xd;
		&quot;req_id&quot;: &quot;7093212f&quot;,&#xd;
		&quot;uid&quot;: &quot;dcd664f3cb1834c3c01a7d30adf5c6efe8&quot;,&#xd;
		&quot;code_ver&quot;: &quot;6185&quot;,&#xd;
		&quot;tag&quot;: &quot;in_house_tracking&quot;,&#xd;
		&quot;sys_info&quot;: &quot;samsung,SM-G9600,9&quot;,&#xd;
		&quot;app_ver&quot;: &quot;5.35.0&quot;,&#xd;
		&quot;api_ver&quot;: &quot;7.0&quot;,&#xd;
		&quot;sdk_ver&quot;: &quot;28&quot;,&#xd;
	    &quot;type&quot;: 3&#xd;
	},&#xd;
	{&#xd;
		&quot;log_ver&quot;: 1,&#xd;
		&quot;timestamp&quot;: 1591091024754,&#xd;
		&quot;level&quot;: &quot;I&quot;,&#xd;
		&quot;message&quot;: &quot;${message_3}&quot;,&#xd;
		&quot;req_id&quot;: &quot;7093212f&quot;,&#xd;
		&quot;uid&quot;: &quot;dcd664f3cb1834c3c01a7d30adf5c6efe8&quot;,&#xd;
		&quot;code_ver&quot;: &quot;6185&quot;,&#xd;
		&quot;tag&quot;: &quot;in_house_tracking&quot;,&#xd;
		&quot;sys_info&quot;: &quot;samsung,SM-G9600,9&quot;,&#xd;
		&quot;app_ver&quot;: &quot;5.35.0&quot;,&#xd;
		&quot;api_ver&quot;: &quot;7.0&quot;,&#xd;
		&quot;sdk_ver&quot;: &quot;28&quot;,&#xd;
	    &quot;type&quot;: 3&#xd;
	}]&#xd;
}&#xd;
</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">dev-frontsrv-new.dev.klook.io</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">utf-8</stringProp>
          <stringProp name="HTTPSampler.path">/v2/frontlogsrv/log/app</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="headers" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">:authority:</stringProp>
                <stringProp name="Header.value">dev-frontsrv-new.dev.klook.io </stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">version</stringProp>
                <stringProp name="Header.value">7.0</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">sdkversion</stringProp>
                <stringProp name="Header.value">9</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">klook-app-version</stringProp>
                <stringProp name="Header.value">5.35.0 </stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">klook-app-version-code</stringProp>
                <stringProp name="Header.value">6184</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">user-agent</stringProp>
                <stringProp name="Header.value">Android Dalvik/2.1.0 (Linux; U; Android 9; SM-G9600 Build/PPR1.180610.011) </stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">x-platform</stringProp>
                <stringProp name="Header.value">android</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">x-signature</stringProp>
                <stringProp name="Header.value">5b1b28d34592b24befc408c8f8ddfb5dae5c828b06e60594b0470398f0dafdb6</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">content-type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">accept-encoding</stringProp>
                <stringProp name="Header.value">gzip</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="message_1" enabled="true">
            <stringProp name="delimiter">,</stringProp>
            <stringProp name="filename">message_1.txt</stringProp>
            <boolProp name="ignoreFirstLine">false</boolProp>
            <boolProp name="quotedData">false</boolProp>
            <boolProp name="recycle">true</boolProp>
            <stringProp name="shareMode">shareMode.all</stringProp>
            <boolProp name="stopThread">false</boolProp>
            <stringProp name="variableNames">message_1</stringProp>
          </CSVDataSet>
          <hashTree/>
          <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="message_2" enabled="true">
            <stringProp name="filename">meaasge_2.txt</stringProp>
            <stringProp name="variableNames">message_2</stringProp>
            <boolProp name="ignoreFirstLine">false</boolProp>
            <stringProp name="delimiter">,</stringProp>
            <boolProp name="quotedData">false</boolProp>
            <boolProp name="recycle">true</boolProp>
            <boolProp name="stopThread">false</boolProp>
            <stringProp name="shareMode">shareMode.all</stringProp>
          </CSVDataSet>
          <hashTree/>
          <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="message_3" enabled="true">
            <stringProp name="filename">message_3.txt</stringProp>
            <stringProp name="variableNames">message_3</stringProp>
            <boolProp name="ignoreFirstLine">false</boolProp>
            <stringProp name="delimiter">,</stringProp>
            <boolProp name="quotedData">false</boolProp>
            <boolProp name="recycle">true</boolProp>
            <boolProp name="stopThread">false</boolProp>
            <stringProp name="shareMode">shareMode.all</stringProp>
          </CSVDataSet>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="响应断言" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-547797305">&quot;success&quot;:true</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">1</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="察看结果树" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>